Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:AdjustPoint edc:offset="0x3DD8" edc:_addr="0x40004228"/>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_CR" edc:nzwidth="0x20" edc:access="-------w----------------w-----ww" edc:impl="0x1000083" edc:_addr="0x40008000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="SPIEN" edc:nzwidth="0x1" edc:desc="SPI Enable"/>
            <edc:SFRFieldDef edc:cname="SPIDIS" edc:nzwidth="0x1" edc:desc="SPI Disable"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="SPI Software Reset"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn------nn--------n-nn-nnn" edc:impl="0xFF0300B7" edc:_addr="0x40008004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="MSTR" edc:nzwidth="0x1" edc:desc="Master/Slave Mode">
              <edc:SFRFieldSemantic edc:cname="MASTER" edc:desc="Master" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SLAVE" edc:desc="Slave" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PS" edc:nzwidth="0x1" edc:desc="Peripheral Select"/>
            <edc:SFRFieldDef edc:cname="PCSDEC" edc:nzwidth="0x1" edc:desc="Chip Select Decode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MODFDIS" edc:nzwidth="0x1" edc:desc="Mode Fault Detection"/>
            <edc:SFRFieldDef edc:cname="WDRBT" edc:nzwidth="0x1" edc:desc="Wait Data Read Before Transfer"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LLB" edc:nzwidth="0x1" edc:desc="Local Loopback Enable"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x2" edc:desc="Peripheral Chip Select">
              <edc:SFRFieldSemantic edc:cname="NPCS0" edc:desc="NPCS0 as Chip Select" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="NPCS1" edc:desc="NPCS1 as Chip Select" edc:when="(field &amp; 0x3) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="DLYBCS" edc:nzwidth="0x8" edc:desc="Delay Between Chip Selects"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_RDR" edc:nzwidth="0x20" edc:access="------------rrrrrrrrrrrrrrrrrrrr" edc:impl="0xFFFFF" edc:_addr="0x40008008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="RD" edc:nzwidth="0x10" edc:desc="Receive Data"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_TDR" edc:nzwidth="0x20" edc:access="-------w----wwwwwwwwwwwwwwwwwwww" edc:impl="0x10FFFFF" edc:_addr="0x4000800C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="TD" edc:nzwidth="0x10" edc:desc="Transmit Data"/>
            <edc:SFRFieldDef edc:cname="PCS" edc:nzwidth="0x4" edc:desc="Peripheral Chip Select">
              <edc:SFRFieldSemantic edc:cname="NPCS0" edc:desc="NPCS0 as Chip Select" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="NPCS1" edc:desc="NPCS1 as Chip Select" edc:when="(field &amp; 0xF) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="LASTXFER" edc:nzwidth="0x1" edc:desc="Last Transfer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_SR" edc:nzwidth="0x20" edc:access="---------------r-----rrrrrrrrrrr" edc:impl="0x107FF" edc:_addr="0x40008010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full (cleared by reading SPI_RDR)"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="Transmit Data Register Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX buffer (cleared by writing SPI_RCR or SPI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX buffer (cleared by writing SPI_TCR or SPI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing SPI_RCR or SPI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing SPI_TCR or SPI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty (cleared by writing SPI_TDR)"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Status (slave mode only) (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPIENS" edc:nzwidth="0x1" edc:desc="SPI Enable Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
