Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_IER" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x40008014">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Enable"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_IDR" edc:nzwidth="0x20" edc:access="---------------------wwwwwwwwwww" edc:impl="0x7FF" edc:_addr="0x40008018">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Disable"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_IMR" edc:nzwidth="0x20" edc:access="---------------------rrrrrrrrrrr" edc:impl="0x7FF" edc:_addr="0x4000801C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="RDRF" edc:nzwidth="0x1" edc:desc="Receive Data Register Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TDRE" edc:nzwidth="0x1" edc:desc="SPI Transmit Data Register Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MODF" edc:nzwidth="0x1" edc:desc="Mode Fault Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="OVRES" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="NSSR" edc:nzwidth="0x1" edc:desc="NSS Rising Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmission Registers Empty Mask"/>
            <edc:SFRFieldDef edc:cname="UNDES" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40008020"/>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_CSR0" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40008030">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="The inactive state value of SPCK is logic level zero" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="The inactive state value of SPCK is logic level one" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:nzwidth="0x1" edc:desc="Clock Phase">
              <edc:SFRFieldSemantic edc:cname="VALID_LEADING_EDGE" edc:desc="Data is valid on clock leading edge (NCPHA=1)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VALID_TRAILING_EDGE" edc:desc="Data is valid on clock trailing edge (NCPHA=0)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:nzwidth="0x1" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:nzwidth="0x1" edc:desc="Chip Select Active After Transfer"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:nzwidth="0x4" edc:desc="Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x08"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:nzwidth="0x8" edc:desc="Serial Clock Baud Rate"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before SPCK"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_CSR1" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40008034">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="CPOL" edc:nzwidth="0x1" edc:desc="Clock Polarity">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="The inactive state value of SPCK is logic level zero" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="The inactive state value of SPCK is logic level one" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NCPHA" edc:nzwidth="0x1" edc:desc="Clock Phase">
              <edc:SFRFieldSemantic edc:cname="VALID_LEADING_EDGE" edc:desc="Data is valid on clock leading edge (NCPHA=1)" edc:when="(field &amp; 0x1) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="VALID_TRAILING_EDGE" edc:desc="Data is valid on clock trailing edge (NCPHA=0)" edc:when="(field &amp; 0x1) == 0x00"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSNAAT" edc:nzwidth="0x1" edc:desc="Chip Select Not Active After Transfer (Ignored if CSAAT = 1)"/>
            <edc:SFRFieldDef edc:cname="CSAAT" edc:nzwidth="0x1" edc:desc="Chip Select Active After Transfer"/>
            <edc:SFRFieldDef edc:cname="BITS" edc:nzwidth="0x4" edc:desc="Bits Per Transfer">
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="8 bits for transfer" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_9_BIT" edc:desc="9 bits for transfer" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_10_BIT" edc:desc="10 bits for transfer" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_11_BIT" edc:desc="11 bits for transfer" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_12_BIT" edc:desc="12 bits for transfer" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="_13_BIT" edc:desc="13 bits for transfer" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="_14_BIT" edc:desc="14 bits for transfer" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="_15_BIT" edc:desc="15 bits for transfer" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="_16_BIT" edc:desc="16 bits for transfer" edc:when="(field &amp; 0xF) == 0x08"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SCBR" edc:nzwidth="0x8" edc:desc="Serial Clock Baud Rate"/>
            <edc:SFRFieldDef edc:cname="DLYBS" edc:nzwidth="0x8" edc:desc="Delay Before SPCK"/>
            <edc:SFRFieldDef edc:cname="DLYBCT" edc:nzwidth="0x8" edc:desc="Delay Between Consecutive Transfers"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xAC" edc:_addr="0x40008038"/>
      <edc:SFRDef ltx:memberofperipheral="SPI" edc:cname="SPI_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400080E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SPI">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x535049"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
