Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40018014"/>
      <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="TWI0_SR" edc:nzwidth="0x20" edc:access="------rr--------rrrrrrrrrrrrrrrr" edc:impl="0x300FFFF" edc:_addr="0x40018020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed (cleared by writing TWIHS_THR)"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready (cleared by reading TWIHS_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready (cleared by writing TWIHS_THR)"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:nzwidth="0x1" edc:desc="Slave Read"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Slave Access"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledged (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:nzwidth="0x1" edc:desc="Clock Wait State"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Slave Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX Buffer (cleared by writing TWIHS_RCR or TWIHS_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX Buffer (cleared by writing TWIHS_TCR or TWIHS_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing TWIHS_RCR or TWIHS_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing TWIHS_TCR or TWIHS_TNCR)"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="SCL" edc:nzwidth="0x1" edc:desc="SCL line value"/>
            <edc:SFRFieldDef edc:cname="SDA" edc:nzwidth="0x1" edc:desc="SDA line value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="TWI0_IER" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwww-www" edc:impl="0xFFF7" edc:_addr="0x40018024">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Slave Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Slave Access Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI0" edc:cname="TWI0_IDR" edc:nzwidth="0x20" edc:access="----------------wwwwwwwwwwww-www" edc:impl="0xFFF7" edc:_addr="0x40018028">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI0">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready Interrupt Disable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Slave Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="UNRE" edc:nzwidth="0x1" edc:desc="Underrun Error Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledge Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="SCL_WS" edc:nzwidth="0x1" edc:desc="Clock Wait State Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Slave Access Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receive Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmit Buffer Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full Interrupt Disable"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmit Buffer Empty Interrupt Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
