Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:AdjustPoint edc:offset="0x30" edc:_addr="0x40030028"/>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_DSPR0" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn-nnnnnn-" edc:impl="0xFF7E" edc:_addr="0x40030058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPFBYP" edc:nzwidth="0x1" edc:desc="High-Pass Filter Bypass"/>
            <edc:SFRFieldDef edc:cname="SINBYP" edc:nzwidth="0x1" edc:desc="SINCC Filter Bypass"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Data Size"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="Oversampling Ratio">
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="Oversampling ratio is 128" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="Oversampling ratio is 64" edc:when="(field &amp; 0x7) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:nzwidth="0x4" edc:desc="Data Scale"/>
            <edc:SFRFieldDef edc:cname="SHIFT" edc:nzwidth="0x4" edc:desc="Data Shift"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_DSPR1" edc:nzwidth="0x20" edc:access="----------------nnnnnnnn-nnnnnn-" edc:impl="0xFF7E" edc:_addr="0x4003005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HPFBYP" edc:nzwidth="0x1" edc:desc="High-Pass Filter Bypass"/>
            <edc:SFRFieldDef edc:cname="SINBYP" edc:nzwidth="0x1" edc:desc="SINCC Filter Bypass"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:nzwidth="0x1" edc:desc="Data Size"/>
            <edc:SFRFieldDef edc:cname="OSR" edc:nzwidth="0x3" edc:desc="Oversampling Ratio">
              <edc:SFRFieldSemantic edc:cname="_128" edc:desc="Oversampling ratio is 128" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_64" edc:desc="Oversampling ratio is 64" edc:when="(field &amp; 0x7) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SCALE" edc:nzwidth="0x4" edc:desc="Data Scale"/>
            <edc:SFRFieldDef edc:cname="SHIFT" edc:nzwidth="0x4" edc:desc="Data Shift"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x84" edc:_addr="0x40030060"/>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400300E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protect Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_WPSR" edc:nzwidth="0x20" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:impl="0xFFFF01" edc:_addr="0x400300E8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:nzwidth="0x1" edc:desc="Write Protection Violation Status"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:nzwidth="0x10" edc:desc="Write Protection Violation Source"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x400300EC"/>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030100">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40030104">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x40030108"/>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40030110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PDMIC1" edc:cname="PDMIC1_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40030114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PDMIC1">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
