Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:SFRDef ltx:memberofperipheral="CHIPID" edc:cname="CHIPID_EXID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x400E0744">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CHIPID">
            <edc:SFRFieldDef edc:cname="EXID" edc:nzwidth="0x20" edc:desc="Chip ID Extension"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xB8" edc:_addr="0x400E0748"/>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_CR" edc:nzwidth="0x20" edc:access="-------------------w---wwwwwww--" edc:impl="0x11FC" edc:_addr="0x400E0800">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:nzwidth="0x1" edc:desc="Reset Receiver"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:nzwidth="0x1" edc:desc="Reset Transmitter"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:nzwidth="0x1" edc:desc="Receiver Enable"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:nzwidth="0x1" edc:desc="Receiver Disable"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:nzwidth="0x1" edc:desc="Transmitter Enable"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:nzwidth="0x1" edc:desc="Transmitter Disable"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:nzwidth="0x1" edc:desc="Reset Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="REQCLR" edc:nzwidth="0x1" edc:desc="Request Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_MR" edc:nzwidth="0x20" edc:access="----------------nn--nnn----n----" edc:impl="0xCE10" edc:_addr="0x400E0804">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:nzwidth="0x1" edc:desc="Receiver Digital Filter">
              <edc:SFRFieldSemantic edc:cname="DISABLED" edc:desc="UART does not filter the receive line." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLED" edc:desc="UART filters the receive line using a three-sample filter (16x-bit clock) (2 over 3 majority)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:nzwidth="0x3" edc:desc="Parity Type">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even Parity" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd Parity" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Space: parity forced to 0" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Mark: parity forced to 1" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:nzwidth="0x2" edc:desc="Channel Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic echo" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local loopback" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote loopback" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_IER" edc:nzwidth="0x20" edc:access="----------------w--ww-w-wwwww-ww" edc:impl="0x9AFB" edc:_addr="0x400E0808">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Enable RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Enable TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Enable End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Enable End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Enable Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Enable Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Enable Parity Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Enable TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Enable Buffer Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Enable Buffer Full Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Enable Comparison Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_IDR" edc:nzwidth="0x20" edc:access="----------------w--ww-w-wwwww-ww" edc:impl="0x9AFB" edc:_addr="0x400E080C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Disable RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Disable TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Disable End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Disable End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Disable Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Disable Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Disable Parity Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Disable TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Disable Buffer Empty Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Disable Buffer Full Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Disable Comparison Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_IMR" edc:nzwidth="0x20" edc:access="----------------r--rr-r-rrrrr-rr" edc:impl="0x9AFB" edc:_addr="0x400E0810">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Mask RXRDY Interrupt"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Disable TXRDY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="Mask End of Receive Transfer Interrupt"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="Mask End of Transmit Interrupt"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Mask Overrun Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Mask Framing Error Interrupt"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Mask Parity Error Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Mask TXEMPTY Interrupt"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Mask TXBUFE Interrupt"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Mask RXBUFF Interrupt"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Mask Comparison Interrupt"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_SR" edc:nzwidth="0x20" edc:access="----------------r--rr-r-rrrrr-rr" edc:impl="0x9AFB" edc:_addr="0x400E0814">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receiver Ready"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmitter Ready"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of Transmitter Transfer"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:nzwidth="0x1" edc:desc="Framing Error"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:nzwidth="0x1" edc:desc="Parity Error"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:nzwidth="0x1" edc:desc="Transmitter Empty"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="Transmission Buffer Empty"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Receive Buffer Full"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CMP" edc:nzwidth="0x1" edc:desc="Comparison Match"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_RHR" edc:nzwidth="0x20" edc:access="------------------------rrrrrrrr" edc:impl="0xFF" edc:_addr="0x400E0818">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:nzwidth="0x8" edc:desc="Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_THR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x400E081C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:nzwidth="0x8" edc:desc="Character to be Transmitted"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_BRGR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0820">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="CD" edc:nzwidth="0x10" edc:desc="Clock Divisor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_CMPR" edc:nzwidth="0x20" edc:access="--------nnnnnnnn-n-n----nnnnnnnn" edc:impl="0xFF50FF" edc:_addr="0x400E0824">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="VAL1" edc:nzwidth="0x8" edc:desc="First Comparison Value for Received Character"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMPMODE" edc:nzwidth="0x1" edc:desc="Comparison Mode">
              <edc:SFRFieldSemantic edc:cname="FLAG_ONLY" edc:desc="Any character is received and comparison function drives CMP flag." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="START_CONDITION" edc:desc="Comparison condition must be met to start reception." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CMPPAR" edc:nzwidth="0x1" edc:desc="Compare Parity"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VAL2" edc:nzwidth="0x8" edc:desc="Second Comparison Value for Received Character"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xBC" edc:_addr="0x400E0828"/>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400E08E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x554152"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18" edc:_addr="0x400E08E8"/>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_RPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x400E0900">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="UART1" edc:cname="UART1_RCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0904">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="UART1">
            <edc:SFRFieldDef edc:cname="RXCTR" edc:nzwidth="0x10" edc:desc="Receive Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
