Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg53/edc/ATSAMG53G19.PIC
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SMMR" edc:nzwidth="0x20" edc:access="------------------nn-nnn----nnnn" edc:impl="0x370F" edc:_addr="0x400E1414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="SMTH" edc:nzwidth="0x4" edc:desc="Supply Monitor Threshold">
              <edc:SFRFieldSemantic edc:cname="V1P6" edc:desc="1.6 V" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="V1P72" edc:desc="1.72 V" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="V1P84" edc:desc="1.84 V" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="V1P96" edc:desc="1.96 V" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="V2P08" edc:desc="2.08 V" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="V2P2" edc:desc="2.2 V" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="V2P32" edc:desc="2.32 V" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="V2P44" edc:desc="2.44 V" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="V2P56" edc:desc="2.56 V" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="V2P68" edc:desc="2.68 V" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="V2P8" edc:desc="2.8 V" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="V2P92" edc:desc="2.92 V" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="V3P04" edc:desc="3.04 V" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="V3P16" edc:desc="3.16 V" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="V3P28" edc:desc="3.28 V" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="V3P4" edc:desc="3.4 V" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SMSMPL" edc:nzwidth="0x3" edc:desc="Supply Monitor Sampling Period">
              <edc:SFRFieldSemantic edc:cname="SMD" edc:desc="Supply Monitor disabled" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CSM" edc:desc="Continuous Supply Monitor" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_32SLCK" edc:desc="Supply Monitor enables one SLCK period every 32 SLCK periods" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_256SLCK" edc:desc="Supply Monitor enables one SLCK period every 256 SLCK periods" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="_2048SLCK" edc:desc="Supply Monitor enables one SLCK period every 2,048 SLCK periods" edc:when="(field &amp; 0x7) == 0x04"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SMRSTEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMIEN" edc:nzwidth="0x1" edc:desc="Supply Monitor Interrupt Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The SUPC interrupt signal is not affected when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The SUPC interrupt signal is asserted when a supply monitor detection occurs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnnnn-n------nn------------" edc:impl="0xFFD03000" edc:_addr="0x400E1418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="BODRSTEN" edc:nzwidth="0x1" edc:desc="POR Core Reset Enable">
              <edc:SFRFieldSemantic edc:cname="NOT_ENABLE" edc:desc="The core reset signal vddcore_nreset is not affected when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core reset signal vddcore_nreset is asserted when a brownout detection occurs." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BODDIS" edc:nzwidth="0x1" edc:desc="POR Core Disable">
              <edc:SFRFieldSemantic edc:cname="ENABLE" edc:desc="The core brownout detector is enabled." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="The core brownout detector is disabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="OSCBYPASS" edc:nzwidth="0x1" edc:desc="Oscillator Bypass">
              <edc:SFRFieldSemantic edc:cname="NO_EFFECT" edc:desc="No effect. Clock selection depends on XTALSEL value." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BYPASS" edc:desc="The 32 kHz crystal oscillator is bypassed if XTALSEL=1. OSCBYPASS must be set prior to write XTALSEL=1." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PSWITCH1" edc:nzwidth="0x1" edc:desc="SRAM1 Power Switch">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The SRAM1 is not powered." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The SRAM1 is powered." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PSWITCH2" edc:nzwidth="0x1" edc:desc="SRAM2 Power Switch">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="The SRAM2 is not powered." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="The SRAM2 is powered." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="KEY" edc:nzwidth="0x8" edc:desc="Password Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation.Always reads as 0." edc:when="(field &amp; 0xFF) == 0xA5"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x400E141C"/>
      <edc:SFRDef ltx:memberofperipheral="SUPC" edc:cname="SUPC_SR" edc:nzwidth="0x20" edc:access="------------------------rrrrr---" edc:impl="0xF8" edc:_addr="0x400E1424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="BODRSTS" edc:nzwidth="0x1" edc:desc="Brownout Detector Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No core brownout rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one brownout output rising edge event has been detected since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMRSTS" edc:nzwidth="0x1" edc:desc="Supply Monitor Reset Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection has generated a core reset since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMS" edc:nzwidth="0x1" edc:desc="Supply Monitor Status (cleared on read)">
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="PRESENT" edc:desc="At least one supply monitor detection since the last read of SUPC_SR." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SMOS" edc:nzwidth="0x1" edc:desc="Supply Monitor Output Status">
              <edc:SFRFieldSemantic edc:cname="HIGH" edc:desc="The supply monitor detected VDDIO higher than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="LOW" edc:desc="The supply monitor detected VDDIO lower than its threshold at its last measurement." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OSCSEL" edc:nzwidth="0x1" edc:desc="32-kHz Oscillator Selection Status">
              <edc:SFRFieldSemantic edc:cname="RC" edc:desc="The slow clock SLCK is generated by the embedded 32 kHz RC oscillator." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CRYST" edc:desc="The slow clock SLCK is generated by the 32 kHz crystal oscillator." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
